IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PADCFG_CTRL0_CFG0.xml
	<register id="CFG0_PADCONFIG79" acronym="CFG0_PADCONFIG79" offset="0x413C" width="32" description="">
		<bitfield id="PADCONFIG79_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG79_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG79_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG79_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG79_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG79_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG79_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG79_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG79_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG80" acronym="CFG0_PADCONFIG80" offset="0x4140" width="32" description="">
		<bitfield id="PADCONFIG80_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG80_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG80_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG80_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG80_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG80_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG80_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG80_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG80_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG81" acronym="CFG0_PADCONFIG81" offset="0x4144" width="32" description="">
		<bitfield id="PADCONFIG81_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG81_TX_DIS" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG81_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG81_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG81_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG81_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG81_ST_EN" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG81_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG81_MUXMODE" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
