IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PADCFG_CTRL0_CFG0.xml
	<register id="CFG0_PADCONFIG175" acronym="CFG0_PADCONFIG175" offset="0x42BC" width="32" description="">
		<bitfield id="PADCONFIG175_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG175_TX_DIS" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG175_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG175_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG175_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG175_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG175_ST_EN" width="1" begin="14" end="14" resetval="0x0" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG175_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG175_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG176" acronym="CFG0_PADCONFIG176" offset="0x42C0" width="32" description="">
		<bitfield id="PADCONFIG176_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG176_TX_DIS" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG176_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG176_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG176_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG176_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG176_ST_EN" width="1" begin="14" end="14" resetval="0x0" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG176_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG176_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG177" acronym="CFG0_PADCONFIG177" offset="0x42C4" width="32" description="">
		<bitfield id="PADCONFIG177_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG177_TX_DIS" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG177_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG177_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG177_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG177_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG177_ST_EN" width="1" begin="14" end="14" resetval="0x0" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG177_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG177_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG178" acronym="CFG0_PADCONFIG178" offset="0x42C8" width="32" description="">
		<bitfield id="PADCONFIG178_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG178_TX_DIS" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG178_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG178_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG178_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG178_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG178_ST_EN" width="1" begin="14" end="14" resetval="0x0" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG178_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG178_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG179" acronym="CFG0_PADCONFIG179" offset="0x42CC" width="32" description="">
		<bitfield id="PADCONFIG179_LOCK" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG179_TX_DIS" width="1" begin="21" end="21" resetval="0x0" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG179_DRV_STR" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG179_RXACTIVE" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG179_PULLTYPESEL" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG179_PULLUDEN" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG179_ST_EN" width="1" begin="14" end="14" resetval="0x0" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG179_DEBOUNCE_SEL" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG179_MUXMODE" width="4" begin="3" end="0" resetval="0x0" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK1_KICK0" acronym="CFG0_LOCK1_KICK0" offset="0x5008" width="32" description="">
		<bitfield id="LOCK1_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_LOCK1_KICK1" acronym="CFG0_LOCK1_KICK1" offset="0x500C" width="32" description="">
		<bitfield id="LOCK1_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG0_PROXY" acronym="CFG0_PADCONFIG0_PROXY" offset="0x6000" width="32" description="">
		<bitfield id="PADCONFIG0_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG0_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG0_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG0_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG0_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG0_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG0_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG0_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG0_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG1_PROXY" acronym="CFG0_PADCONFIG1_PROXY" offset="0x6004" width="32" description="">
		<bitfield id="PADCONFIG1_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG1_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG1_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG1_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG1_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG1_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG1_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG1_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG1_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG0_PADCONFIG2_PROXY" acronym="CFG0_PADCONFIG2_PROXY" offset="0x6008" width="32" description="">
		<bitfield id="PADCONFIG2_LOCK_PROXY" width="1" begin="31" end="31" resetval="0x0" description="Lock   0 - Padconfig register is unlocked   1 - Padconfig register is locked from further writes" range="31" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG2_TX_DIS_PROXY" width="1" begin="21" end="21" resetval="0x1" description="Driver Disable 0 - Driver is enabled 1 - Driver is disabled" range="21" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG2_DRV_STR_PROXY" width="2" begin="20" end="19" resetval="0x0" description="Drive Strength Control .  Selects the drive strength value for LVCMOS pins.  (Does not apply to other pin types)" range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG2_RXACTIVE_PROXY" width="1" begin="18" end="18" resetval="0x0" description="Input enable for the Pad 0 - Receiver disabled 1 - Receiver enabled" range="18" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG2_PULLTYPESEL_PROXY" width="1" begin="17" end="17" resetval="0x0" description="Pad Pullup / Pulldown type selection 0 - Pulldown selected 1 - Pullup selected" range="17" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG2_PULLUDEN_PROXY" width="1" begin="16" end="16" resetval="0x1" description="Pad Pullup / Pulldown enable. This is an active low signal. 0 - Pullup / Pulldown enabled 1 - Pullup / Pulldown disabled" range="16" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG2_ST_EN_PROXY" width="1" begin="14" end="14" resetval="0x1" description="Receiver Schmitt Trigger enable   0 - Schmitt trigger input disabled   1 - Schmitt trigger input enabled" range="14" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG2_DEBOUNCE_SEL_PROXY" width="3" begin="13" end="11" resetval="0x0" description="Selects the debouce period for the pad." range="13 - 11" rwaccess="R/W"/> 
		<bitfield id="PADCONFIG2_MUXMODE_PROXY" width="4" begin="3" end="0" resetval="0x7" description="Pad functional signal mux selection Field values (others are reserved): 4'b0000 - Mux Mode 0 4'b0001 - Mux Mode 1 4'b0010 - Mux Mode 2 4'b0011 - Mux Mode 3 4'b0100 - Mux Mode 4 4'b0101 - Mux Mode 5 4'b0110 - Mux Mode 6 4'b0111 - Mux Mode 7 4'b1000 - Mux Mode 8 4'b1001 - Mux Mode 9 4'b1010 - Mux Mode 10 4'b1011 - Mux Mode 11 4'b1100 - Mux Mode 12 4'b1101 - Mux Mode 13 4'b1110 - Mux Mode 14 4'b1111 - Mux Mode 15" range="3 - 0" rwaccess="R/W"/>
	</register>
